tests/taurus/geocoding/berlin.yml
---
execution:
- concurrency: 2000
  ramp-up: 2m
  hold-for: 10m
  scenario: berlin

scenarios:
  berlin:
    requests:
    - https://api.openrouteservice.org/v1/test/geocoding?format=json&query=Berlin&api_key=f063f9a4600144b6b1c85356b24f4a63

reporting:
    - module: blazemeter
      report-name: OpenRouteService Geocoding API Concurrency Performance